Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_primary_school/types_primary_school.html.txt.tmx
Source language: en
Languages: ga

source: Children starting school can attend national schools, which are State-aided and do not charge fees, or they can attend one of a small number of private primary schools, which do not get any State funding and which charge fees. The vast majority of children attend the state-aided primary or national schools
ga: Is féidir le páistí atá ag tosú scoile freastail ar bhunscoileanna atá ag fáil deontaisí Stáit agus nach mbaineann amach táillí, nó is féidir leo freastal ar cheann d'uimhir bheag bunscoileanna príobháideacha nach bhfaigheann aon airgead Stáit ach a bhaineann amach táillí

source: The rules about school attendance apply from age 6
ga: Bíonn na rialacha tinrimh scoile i bhfeidhm ó aois a 6

source: In practice, nearly all 5-year-olds are at school and about half of 4-year-olds in Ireland also attend school
ga: De ghnáth, bíonn beagnach gach páiste chúig bhliana d'aois ag freastal ar scoil agus bíonn timpeall leath na páistí cheithre bliana d'aois, ag freastal ar scoil freisin

source: Children may not be enrolled at primary school before the age of 4
ga: Ní féidir páiste a chlár i mbunscoil faoi aois a 4

source: There are various early education or pre-school facilities available but they are mostly private and fees have to be paid
ga: Tá roinnt áiseanna luathoideachais agus réamhscoilear fáil ach tá siad príobháideach den chuid is mó agus tá táillí le n-íoc orthu

source: There are some State-funded pre-school facilities, which are usually for children who are disadvantaged or have special needs
ga: Maoiníonn an Stát bliain amháin réamhscolaíochta saor in aisce, áfach, tríd an Sceím Cúraim agus Oideachais Luath-Óige (COLÓ)

source: The State also funds one year of free pre-schooling under the Early Childhood Care and Education (ECCE) Scheme
ga: Tá roinnt áiseanna réamhscoile atá ag fáil deontas Stáit do pháistí faoi mhíbhuntáiste den chuid is mó nó dóibh siúd go bhfuil riachtanais speisiálta acu

source: There is a system of regulation of pre-schools under the Child Care Act 1991
ga: Tá córas rialacháin ann d'áiseanna réamhscoile faoin Acht Cúram Leanaí 1991

source: The national school system was established in 1831
ga: Bunaíodh córas na scoile náisiúnta i 1831

source: The national schools were originally meant to be mixed-religion (or multi-denominational as we would describe them today)
ga: Bhí na scoileanna náisiúnta ceaptha a bheith ag freastal ar pháistí reiligiún measctha ar dtús nó ilchreidmheach mar a déarfaimis inniu

source: In practice, that did not happen and the majority of national schools are under the management of one church
ga: Ní mar sin a thárla agus in dáiríre tá formhór na scoileanna náisiúnta faoi bhainistíocht eaglaise amháin

source: However, since the 1970s Educate Together has established many multi-denominational national schools
ga: Tá scoileanna ilchreidmheacha á riaradh ag Educate Together, áfach

source: When the national schools were originally set up, there was no legislation governing how they were to be run
ga: Nuair a bunaíodh na scoileanna náisiúnta ar dtús, ní raibh aon achtú ann ag rialú an chaoi a stiúrfaí iad

source: Circulars and rules issued from the relevant department instead
ga: Tháinig rialacha agus imlitreacha ón Roinn in ionad sin

source: The Rules for National Schools reflect the fact that they are largely denominational schools
ga: Taispeánann Rialacha do Scoileanna Náisiúnta gur scoileanna ilchreidmheach iad den chuid is mó

source: The Education Act 1998 does not use the term 'national school' and instead uses 'primary' school
ga: Ní úsáideann an tAcht Oideachais 1998 an téarma 'scoil náisiúnta' ach 'bunscoil'

source: The name is not particularly significant except that 'national school' clearly indicates that the school is State-aided while a primary school can be private or State-aided
ga: Ní dhéanann an t-ainm mórán difríochta ach go dtuigtear go bhfuil deontas Stáit ann do scoil náisiúnta agus gur féidir le bunscoil a bheith príobháideach nó deontas Stáit a bheith aici

source: The following initials are frequently used to describe schools:
ga: Úsáidtear na cinnlitreacha seo leanas go minic le cur síos orthu

source: NS - National School
ga: NS (SN) - Scoil Náisiúnta

source: GNS - Girls' National School
ga: GNS (SNC) – Scoil Náisiúnta Cailíní

source: BNS - Boys' National School
ga: BNS (SNB) – Scoil Náisiúnta Buachaillí

source: SN - Scoil Naisiúnta (appears before the name rather than after it)
ga: SN – Scoil Náisiúnta (roimh an ainm)

source: Some schools use the Irish form of their name but that does not necessarily mean that they teach through the medium of Irish
ga: Úsáideann roinnt scoileanna an leagan Ghaeilge dá nainm ach ní chiallaíonn sé sin go múintear tré mheán na Gaeilge iontu

source: Gaelscoileanna are schools that teach through Irish and they usually, but not invariably, include the word 'Gaelscoil' in their title
ga: Is scoileanna náisiúnta iad Gaelscoileanna a mhúineann tré Ghaeilge, agus de ghnáth ach ní i gcónaí, bíonn Gaelscoil ina dteideal

source: Multi-denominational schools sometimes include that description in their title
ga: Úsáideann scoileanna ilchreidmheachaan téarma sin uaireanta ina dteideal féin

source: Some primary schools are run by religious orders - they are sometimes called convent or monastery schools
ga: Bíonn roinnt bunscoileanna stiúrtha ag oird eaglasta – glaotar scoileanna clochair nó mainistreach orthu uaireanta

source: They operate under the same rules as other primary schools except for some special rules relating to the appointment of principals and the choice of teacher representatives on the board of management
ga: Oibríonn siad faoi na rialacha céanna le scoileanna náisiúnta eile, ach go bhfuil roinnt rialacha speisialta maidir le ainmiúchán na bpríomhoidí agus an rogha múinteoirí ar an mBord Bainistíochta

source: The Department of Education and Skills lists schools geographically under Find a School
ga: Tá Liosta de Bunscoileanna foilsithe ag an Roinn Oideachais agus Scileanna

source: There are several special schools - including residential care units and schools for children with disabilities, young offenders, children at risk, children with specific learning disabilities and emotionally disturbed children
ga: Tá roinnt scoileanna speisiálta ann – ag tógáil san áireamh aonaid cúram cónaitheach agus scoileanna do pháistí le míchumas, ógchiontóirí, páistí i mbaol, páistí le míchumas foghlamtha áirithe agus páistí le suaitheadh sochorraitheach

source: The ownership of primary schools is quite complex
ga: Tá úinéireacht na mbunscoileanna casta go leor

source: In general, they are privately owned and State-funded
ga: Go ginearálta tá siad in úinéireacht phríobháideach agus iad maoinithe ag an Stát

source: While the school ethos is decided by the owners, the operating rules are largely set by the State
ga: Cé go ndéanann na húinéirí socrú ar mheoin na scoile, bíonn na rialacha stiúrtha leagtha síos ag an Stát den chuid is mó

source: A Forum on Patronage and Pluralism in the Primary Sector was set up in 2011 to consider how primary school patronage structures might be adapted to reflect changes in society
ga: Cuireadh Fóram faoi Phátrúnacht agus Iolrachas san Earnáil Bhunscoile ar bun i 2011 chun a mheas conas na struchtúir phátrúnachta bunscoile a athchóiriú chun aird a thabhairt ar athruithe sa tsochaí

source: Its report was published on 10 April 2012
ga: Foilsíodh a thuarascáil an 10 Aibreán 2012

source: Private primary schools receive no State support, nor are they subject to State control in relation to curriculum, school day, school year, etc
ga: Ní fhaigheann bunscoileanna phríobháideacha aon chabhair Stáit agus níl siad faoi cheannas Stáit maidir leis an gcúrsa léinn, an lá scoile, scoilbhliain & rl

source: There is a limited element of State assessment of private schools because the State is required to ensure that children receive a certain minimum education
ga: Tá roinnt bheag measúnú stáit ar scoileanna phríobháideacha mar gheall go bhfuil orthu déanamh cinnte de go bhfaigheann páistí méid áirithe oideachais

source: Teachers in private primary schools are not paid by the State and there are no requirements about their qualifications
ga: Ní íocann an Stát múinteoirí i mbunscoileanna phríobháideacha agus níl aon choinníollacha maidir lena gcáilíochtaí

source: Many private primary schools do provide the basic curriculum as set out for national schools but they are not obliged to do so
ga: Cuireann go leor bunscoileanna príobháideacha an cúrsa léinn bunúsach mar atá leagtha síos do scoileanna náisiúnta ar fáil ach ní gá dóibh seo a dhéanamh

source: Parents have a constitutional right to choose the kind of school to which they want to send their children and have a right to educate them at home if they wish
ga: Tá ceart bunreachtúil ag tuismitheoirí an cineál scoile atá siad ag iarraidh dá bpáistí a roghnú agus tá ceart acu oideachas a chur ar na páistí sa mbaile má's mian leo

source: There is no absolute requirement on schools to admit any particular student
ga: Níl gá do scoileanna aon chineál scoláire a chlárú

source: Schools are required to publish their admissions policy
ga: Tá iachall ar scoileanna a bpolasaí cláraithe a fhoilsiú

source: Schools are subject to equal status legislation and to the constitutional requirements on religion
ga: Tá scoileanna faoin Reachtú stadais Comhionannais agus na coinníollacha bunreachtúla maidir le reiligiún

source: All primary schools are obliged to publish a school plan that describes their ethos, admissions policy and objectives
ga: Ní mór do gach bunscoil plean scoile a fhoilsiú ina bhfuil cur síos ar éiteas, beartas i leith iontrálacha agus cuspóirí na scoile

source: The admissions policy of most primary schools is fairly straightforward - they give priority to children from their local area, which, for denominational schools, is usually the local parish
ga: Bíonn beartas formhór na mbunscoileanna i leith iontrálacha soiléir go leor - tugann siad tús áite do leanaí óna limistéir féin, agus i gcás scoileanna sanchreideamhacha is é an paróiste áitiúil an limistéar sin

source: Admissions problems can arise in expanding areas where the school cannot cope with extra numbers
ga: Is féidir fadhbanna maidir le hiontrálacha a bheith i limistéir atá ag fás nuair nach féidir leis an scoil déileáil le líon breise páistí nua

source: Where there is an accommodation problem, the school must give priority on the basis of their admissions policy, sometimes called an enrolment policy
ga: Má bhíonn fadhb cóiríochta ann ní mór don scoil tosaíocht a thabhairt do leanaí ar bhunús a beartas i leith iontrálacha. Uaireanta tugtar beartas rollaithe air seo

source: This is drawn up by the board of management and should be available to you on request
ga: Is é an bord bainistíochta a dhréachtann é agus ba chóir go bhféadfá é a fháil ach é a iarraidh

source: Schools run by the minority religions usually give priority to their co-religionists
ga: De ghnáth tugann scoileanna atá á reáchtáil ag creidimh mhionlaigh tús áite do leanaí a bhfuil an creideamh céanna acu

source: The admissions policy for multi-denominational and non-denominational schools and Gaelscoileanna is decided by each school
ga: I gcás scoileanna ilchreideamhacha, scoileanna neamh-shainchreidmheacha agus Gaelscoileanna is í an scoil féin a cheapann a beartas i leith iontrálacha

source: The admissions policy must comply with section 7 of the Equal Status Act 2000
ga: Caithfidh an beartas i leith iontrálacha géilleadh d’Alt 7 den Acht um Stádas Comhionann 2000

source: If a school refuses to enrol your child you may appeal the decision to the school’s board of management
ga: Má dhiúltaíonn scoil do leanbhsa a chur ar an rolla féadfaidh tú achomharc a dhéanamh chuig an mbord bainistíochta faoin gcinneadh

source: If this does not succeed you may appeal the decision to the Department of Education and Skills
ga: Má theipeann air seo féadfaidh tú achomharc a dhéanamh chuig an Roinn Oideachais agus Scileanna

source: More information about this is in the Circular 22/02 Appeals Procedures under Section 29 of the Education Act 1998 and in the Department's section document on appeals procedures
ga: Is féidir tuilleadh eolais a fháil faoi seo i gCiorclán 22/02 Nósanna Imeachta faoi Alt 29 den Acht Oideachais 1998 agus sa doiciméad faoi nósanna imeachta achomharc a d’eisigh an Roinn

source: When choosing a primary school, parents may also need to know about the admissions policies of secondary schools
ga: D’fhéadfadh sé tarlú go mbeadh gá do thuismitheoirí fios a bheith acu agus iad ag roghnú bunscoile faoi bheartais na meánscoileanna i leith iontrálacha

source: Some secondary schools give priority to the students from certain primary schools
ga: Tá roinnt meánscoileanna ann a thugann tús áite do dhaltaí ó bhunscoileanna áirithe
